FOAMySeesExampleCases/FixedFixedBeam/Fluid/0.org/pointDisplacement

        /*--------------------------------*- C++ -*----------------------------------*        \*---------------------------------------------------------------------------*/
        FoamFile{
        version     2.0;
        format      ascii;
        class       pointVectorField;
        object      pointDisplacement;}
        
        // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
        dimensions    [0 1 0 0 0 0 0];
        internalField uniform (0 0 0);
        boundaryField{
            sideB
    {
        type           empty;
    }

sideA
    {
        type             fixedValue;
		value uniform (0 0 0);
    }
            atmosphere{type           fixedNormalSlip;
                value           $internalField;
                n (0 -1 0);}

            defaultFaces{type            fixedNormalSlip;
                value           $internalField;
                n (0 1 0);}

            
            interface{
            type fixedValue;
			value uniform (0 0 0);
            }}
        
        // ************************************************************************* //
        