FOAMySeesExampleCases/FixedFixedBeam/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "./precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh;
    patches           (interface);
    locations         faceCenters;
    
    readData
    (
      Displacement
    );
    
    writeData
    (
      Force
    );
  };
};


FSI
{
//solverType incompressible;
//solverType compressible;
//solverType basic;
//rho rho [1 -3 0 0 0 0 0] 1000; 
}
